vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
#include <Arduino.h>
#include <ArduinoJson.h>
#include <esp_arduino_version.h>
#include <HTTPClient.h>
#if ESP_ARDUINO_VERSION_MAJOR >= 3
#include <ESP_I2S.h>
#define AI_PET_USE_ESP_I2S 1
#else
#include <I2S.h>
#define AI_PET_USE_ESP_I2S 0
#endif
#include <Preferences.h>
#include <WebServer.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>

#include "BringupConfig.h"

namespace {

constexpr const char *kPrefsNamespace = "ai-pet-fw";
constexpr const char *kPrefsKeySsid = "wifi_ssid";
constexpr const char *kPrefsKeyPassword = "wifi_pass";
constexpr const char *kPrefsKeyCloudBaseUrl = "cloud_url";
constexpr const char *kPrefsKeySessionId = "session_id";
constexpr const char *kPrefsKeyDeviceId = "device_id";
constexpr const char *kPrefsKeyLocale = "locale";

constexpr uint32_t kSerialBaud = AI_PET_SERIAL_BAUD;
constexpr uint32_t kAudioSampleRateHz = AI_PET_AUDIO_SAMPLE_RATE_HZ;
constexpr uint32_t kAudioCaptureMs = AI_PET_AUDIO_CAPTURE_MS;
constexpr uint32_t kAudioCaptureStallTimeoutMs = AI_PET_AUDIO_CAPTURE_STALL_TIMEOUT_MS;
constexpr bool kEnablePlayback = AI_PET_ENABLE_PLAYBACK != 0;
constexpr bool kEnableLightweightVad = AI_PET_ENABLE_LIGHTWEIGHT_VAD != 0;
constexpr uint32_t kVadFrameMs = AI_PET_VAD_FRAME_MS;
constexpr uint32_t kVadBootstrapMs = AI_PET_VAD_BOOTSTRAP_MS;
constexpr uint32_t kVadPreRollMs = AI_PET_VAD_PREROLL_MS;
constexpr uint32_t kVadMinCaptureMs = AI_PET_VAD_MIN_CAPTURE_MS;
constexpr uint32_t kVadMaxCaptureMs = AI_PET_VAD_MAX_CAPTURE_MS;
constexpr uint32_t kVadEndSilenceMs = AI_PET_VAD_END_SILENCE_MS;
constexpr uint32_t kVadEndConfirmMs = AI_PET_VAD_END_CONFIRM_MS;
constexpr uint32_t kVadStartTriggerFrames = AI_PET_VAD_START_TRIGGER_FRAMES;
constexpr uint32_t kVadStartRatioNum = AI_PET_VAD_START_RATIO_NUM;
constexpr uint32_t kVadStartRatioDen = AI_PET_VAD_START_RATIO_DEN;
constexpr uint32_t kVadStartOffsetAbs = AI_PET_VAD_START_OFFSET_ABS;
constexpr uint32_t kVadStartFloorAbs = AI_PET_VAD_START_FLOOR_ABS;
constexpr uint32_t kVadEndRatioNum = AI_PET_VAD_END_RATIO_NUM;
constexpr uint32_t kVadEndRatioDen = AI_PET_VAD_END_RATIO_DEN;
constexpr uint32_t kVadEndOffsetAbs = AI_PET_VAD_END_OFFSET_ABS;
constexpr uint32_t kVadEndFloorAbs = AI_PET_VAD_END_FLOOR_ABS;
constexpr uint32_t kVadResumeTriggerFrames = AI_PET_VAD_RESUME_TRIGGER_FRAMES;
constexpr uint32_t kVadResumeOffsetAbs = AI_PET_VAD_RESUME_OFFSET_ABS;
constexpr uint32_t kVadNearMaxEndSilenceMs = AI_PET_VAD_NEAR_MAX_END_SILENCE_MS;
constexpr uint32_t kVadNearMaxWindowMs = AI_PET_VAD_NEAR_MAX_WINDOW_MS;
constexpr uint32_t kVadPostSpeechMaxMs = AI_PET_VAD_POST_SPEECH_MAX_MS;
constexpr uint32_t kVadPostSpeechGuardMinSilenceMs =
    AI_PET_VAD_POST_SPEECH_GUARD_MIN_SILENCE_MS;
constexpr size_t kVadFrameSampleCount = (kAudioSampleRateHz * kVadFrameMs) / 1000;
constexpr size_t kVadBootstrapFrameCount =
    (kVadBootstrapMs / kVadFrameMs) > 0 ? (kVadBootstrapMs / kVadFrameMs) : 1;
constexpr size_t kVadPreRollSampleCount = (kAudioSampleRateHz * kVadPreRollMs) / 1000;
constexpr size_t kVadMaxSampleCount = (kAudioSampleRateHz * kVadMaxCaptureMs) / 1000;
constexpr uint32_t kWifiConnectTimeoutMs = AI_PET_WIFI_CONNECT_TIMEOUT_MS;
constexpr uint32_t kWifiRetryIntervalMs = AI_PET_WIFI_RETRY_INTERVAL_MS;
constexpr uint32_t kCloudConnectTimeoutMs = AI_PET_CLOUD_CONNECT_TIMEOUT_MS;
constexpr uint32_t kHttpTimeoutMs = AI_PET_HTTP_TIMEOUT_MS;
constexpr int kPdmDataPin = AI_PET_PDM_DATA_PIN;
constexpr int kPdmClockPin = AI_PET_PDM_CLOCK_PIN;
constexpr uint32_t kPlaybackDefaultSampleRateHz = AI_PET_PLAYBACK_DEFAULT_SAMPLE_RATE_HZ;
constexpr uint8_t kPlaybackBitsPerSample = AI_PET_PLAYBACK_BITS_PER_SAMPLE;
constexpr uint8_t kPlaybackChannels = AI_PET_PLAYBACK_CHANNELS;
constexpr int kPlaybackBclkPin = AI_PET_MAX98357_BCLK_PIN;
constexpr int kPlaybackLrclkPin = AI_PET_MAX98357_LRCLK_PIN;
constexpr int kPlaybackDinPin = AI_PET_MAX98357_DIN_PIN;
constexpr size_t kPlaybackWriteChunkBytes = AI_PET_PLAYBACK_I2S_WRITE_CHUNK_BYTES;
constexpr size_t kI2sReadChunkBytes = AI_PET_I2S_READ_CHUNK_BYTES;

const char *kFirmwareVersion = AI_PET_FIRMWARE_VERSION;
const char *kDefaultDeviceId = AI_PET_DEFAULT_DEVICE_ID;
const char *kDefaultLocale = AI_PET_DEFAULT_LOCALE;
const char *kDefaultCloudBaseUrl = AI_PET_DEFAULT_CLOUD_BASE_URL;
const char *kPairingApPassword = AI_PET_PAIRING_AP_PASSWORD;
const char *kCloudCaCertPem = nullptr;
constexpr bool kAllowInsecureHttps = AI_PET_ALLOW_INSECURE_HTTPS != 0;

enum class DeviceState {
  Booting,
  PairingReady,
  ConnectingWiFi,
  WiFiConnected,
  ConnectingCloud,
  ReadyToSpeak,
  Listening,
  Thinking,
  Speaking,
  Error,
};

enum class ErrorCode {
  None,
  ConfigMissing,
  WiFiConnectFailed,
  CloudProbeFailed,
  TlsConfigRequired,
  MicInitFailed,
  MicCaptureFailed,
  CloudRequestFailed,
  JsonParseFailed,
  CloudAudioMissing,
  PlaybackInitFailed,
  PlaybackDecodeFailed,
  PlaybackUnsupported,
  PlaybackWriteFailed,
};

enum class CaptureStrategy {
  FixedWindow,
  LightweightVad,
};

enum class VadState {
  Priming,
  WaitingForSpeech,
  Speaking,
  TrailingSilence,
  ConfirmingEnd,
  FallbackFixedWindow,
  Complete,
};

enum class CaptureExitReason {
  FixedWindow,
  EndOfSpeech,
  FallbackNoSpeech,
  MaxCapture,
};

struct RuntimeConfig {
  String ssid;
  String password;
  String cloudBaseUrl;
  String sessionId;
  String deviceId;
  String locale;

  bool hasWiFiCredentials() const { return !ssid.isEmpty(); }

  bool hasCloudConfig() const {
    return !cloudBaseUrl.isEmpty() && !sessionId.isEmpty() && !deviceId.isEmpty();
  }
};

struct ParsedUrl {
  bool valid = false;
  bool secure = false;
  String host;
  uint16_t port = 0;
  String basePath = "";
};

struct CapturedAudio {
  int16_t *samples = nullptr;
  size_t byteCount = 0;
  size_t sampleCount = 0;
  uint32_t durationMs = 0;
  CaptureStrategy strategy = CaptureStrategy::FixedWindow;
  CaptureExitReason exitReason = CaptureExitReason::FixedWindow;
  bool speechDetected = false;
};

struct CloudResponseSummary {
  int httpStatus = 0;
  String sessionState;
  String transcript;
  String responseText;
  String audioBase64;
  String audioFormat;
  String audioUrl;
  String fallbackMode;
  String runtimeFailureCode;
};

struct ParsedWavePcm {
  uint16_t audioFormat = 0;
  uint16_t channelCount = 0;
  uint32_t sampleRateHz = 0;
  uint16_t bitsPerSample = 0;
  const uint8_t *pcmData = nullptr;
  size_t pcmByteCount = 0;
};

struct HttpResponseMetadata {
  int statusCode = 0;
  bool chunked = false;
  int contentLength = -1;
  String contentType;
};

Preferences g_preferences;
WebServer g_server(80);
RuntimeConfig g_config;
DeviceState g_state = DeviceState::Booting;
ErrorCode g_lastError = ErrorCode::None;
String g_lastErrorDetail;
String g_lastTranscript;
String g_lastResponseText;
String g_lastRuntimeFailureCode = "none";
String g_lastSessionState = "unknown";
String g_lastPlaybackResult = "idle";
String g_lastPlaybackAudioFormat = "none";
uint32_t g_lastPlaybackSampleRateHz = 0;
uint16_t g_lastPlaybackChannels = 0;
size_t g_lastPlaybackPcmBytes = 0;
String g_pairingApSsid;
bool g_pairingPortalActive = false;
bool g_micInitialized = false;
bool g_playbackInitialized = false;
bool g_wifiConnected = false;
bool g_cloudReachable = false;
bool g_reconnectRequested = false;
uint32_t g_lastReconnectAttemptAtMs = 0;
uint32_t g_turnCounter = 0;
#if AI_PET_USE_ESP_I2S
I2SClass g_i2s;
I2SClass g_playbackI2s;
#endif

