vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
String trimCopy(const String &value) {
  String copy = value;
  copy.trim();
  return copy;
}

String chipSuffix() {
  const uint64_t mac = ESP.getEfuseMac();
  char buffer[7];
  snprintf(buffer, sizeof(buffer), "%06llX", mac & 0xFFFFFFULL);
  return String(buffer);
}

String defaultDeviceId() {
  return String(kDefaultDeviceId) + "-" + chipSuffix();
}

const char *deviceStateToString(const DeviceState state) {
  switch (state) {
  case DeviceState::Booting:
    return "booting";
  case DeviceState::PairingReady:
    return "pairing_ready";
  case DeviceState::ConnectingWiFi:
    return "connecting_wifi";
  case DeviceState::WiFiConnected:
    return "wifi_connected";
  case DeviceState::ConnectingCloud:
    return "connecting_cloud";
  case DeviceState::ReadyToSpeak:
    return "ready_to_speak";
  case DeviceState::Listening:
    return "listening";
  case DeviceState::Thinking:
    return "thinking";
  case DeviceState::Speaking:
    return "speaking";
  case DeviceState::Error:
    return "error";
  }
  return "unknown";
}

const char *errorCodeToString(const ErrorCode code) {
  switch (code) {
  case ErrorCode::None:
    return "none";
  case ErrorCode::ConfigMissing:
    return "config_missing";
  case ErrorCode::WiFiConnectFailed:
    return "wifi_connect_failed";
  case ErrorCode::CloudProbeFailed:
    return "cloud_connect_failed";
  case ErrorCode::TlsConfigRequired:
    return "tls_config_required";
  case ErrorCode::MicInitFailed:
    return "mic_init_failed";
  case ErrorCode::MicCaptureFailed:
    return "audio_capture_failed";
  case ErrorCode::CloudRequestFailed:
    return "cloud_request_failed";
  case ErrorCode::JsonParseFailed:
    return "json_parse_failed";
  case ErrorCode::CloudAudioMissing:
    return "cloud_audio_missing";
  case ErrorCode::PlaybackInitFailed:
    return "playback_init_failed";
  case ErrorCode::PlaybackDecodeFailed:
    return "playback_decode_failed";
  case ErrorCode::PlaybackUnsupported:
    return "playback_unsupported";
  case ErrorCode::PlaybackWriteFailed:
    return "playback_write_failed";
  }
  return "unknown";
}

const char *captureStrategyToString(const CaptureStrategy strategy) {
  switch (strategy) {
  case CaptureStrategy::FixedWindow:
    return "fixed_window";
  case CaptureStrategy::LightweightVad:
    return "lightweight_vad";
  }
  return "unknown";
}

const char *vadStateToString(const VadState state) {
  switch (state) {
  case VadState::Priming:
    return "priming";
  case VadState::WaitingForSpeech:
    return "waiting_for_speech";
  case VadState::Speaking:
    return "speaking";
  case VadState::TrailingSilence:
    return "trailing_silence";
  case VadState::ConfirmingEnd:
    return "confirming_end";
  case VadState::FallbackFixedWindow:
    return "fallback_fixed_window";
  case VadState::Complete:
    return "complete";
  }
  return "unknown";
}

const char *captureExitReasonToString(const CaptureExitReason reason) {
  switch (reason) {
  case CaptureExitReason::FixedWindow:
    return "fixed_window";
  case CaptureExitReason::EndOfSpeech:
    return "end";
  case CaptureExitReason::FallbackNoSpeech:
    return "fallback";
  case CaptureExitReason::MaxCapture:
    return "max_capture";
  }
  return "unknown";
}

void logLine(const String &message) { Serial.println("[bringup] " + message); }

void logStatusSummary() {
  Serial.printf(
      "[status] state=%s wifi=%s cloud=%s error=%s ip=%s session=%s\n",
      deviceStateToString(g_state),
      g_wifiConnected ? "connected" : "disconnected",
      g_cloudReachable ? "reachable" : "unreachable",
      errorCodeToString(g_lastError),
      WiFi.localIP().toString().c_str(),
      g_config.sessionId.c_str());
  Serial.printf("[playback] result=%s format=%s rate=%lu channels=%u bytes=%u\n",
                g_lastPlaybackResult.c_str(),
                g_lastPlaybackAudioFormat.c_str(),
                static_cast<unsigned long>(g_lastPlaybackSampleRateHz),
                g_lastPlaybackChannels,
                static_cast<unsigned int>(g_lastPlaybackPcmBytes));
}

void transitionTo(const DeviceState nextState, const String &reason = String()) {
  g_state = nextState;
  if (reason.isEmpty()) {
    logLine("state -> " + String(deviceStateToString(nextState)));
  } else {
    logLine("state -> " + String(deviceStateToString(nextState)) + " | " + reason);
  }
}

void setError(const ErrorCode code, const String &detail) {
  g_lastError = code;
  g_lastErrorDetail = detail;
  transitionTo(DeviceState::Error, String(errorCodeToString(code)) + " | " + detail);
}

void clearError() {
  g_lastError = ErrorCode::None;
  g_lastErrorDetail = "";
}

String escapeHtml(const String &input) {
  String output;
  output.reserve(input.length() + 16);
  for (size_t i = 0; i < input.length(); ++i) {
    const char c = input.charAt(i);
    switch (c) {
    case '&':
      output += "&amp;";
      break;
    case '<':
      output += "&lt;";
      break;
    case '>':
      output += "&gt;";
      break;
    case '"':
      output += "&quot;";
      break;
    case '\'':
      output += "&#39;";
      break;
    default:
      output += c;
      break;
    }
  }
  return output;
}

String escapeJson(const String &input) {
  String output;
  output.reserve(input.length() + 16);
  for (size_t i = 0; i < input.length(); ++i) {
    const char c = input.charAt(i);
    switch (c) {
    case '\\':
      output += "\\\\";
      break;
    case '"':
      output += "\\\"";
      break;
    case '\n':
      output += "\\n";
      break;
    case '\r':
      output += "\\r";
      break;
    case '\t':
      output += "\\t";
      break;
    default:
      output += c;
      break;
    }
  }
  return output;
}

String encodeBase64(const uint8_t *data, const size_t length) {
  static const char table[] =
      "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

  String encoded;
  encoded.reserve(((length + 2) / 3) * 4);

  for (size_t index = 0; index < length; index += 3) {
    const uint32_t octetA = data[index];
    const uint32_t octetB = (index + 1 < length) ? data[index + 1] : 0;
    const uint32_t octetC = (index + 2 < length) ? data[index + 2] : 0;
    const uint32_t triple = (octetA << 16U) | (octetB << 8U) | octetC;

    encoded += table[(triple >> 18U) & 0x3FU];
    encoded += table[(triple >> 12U) & 0x3FU];
    encoded += (index + 1 < length) ? table[(triple >> 6U) & 0x3FU] : '=';
    encoded += (index + 2 < length) ? table[triple & 0x3FU] : '=';
  }

  return encoded;
}

