vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
size_t base64EncodedLength(const size_t inputLength) {
  return ((inputLength + 2) / 3) * 4;
}

int8_t decodeBase64Char(const char value) {
  if (value >= 'A' && value <= 'Z') {
    return value - 'A';
  }
  if (value >= 'a' && value <= 'z') {
    return value - 'a' + 26;
  }
  if (value >= '0' && value <= '9') {
    return value - '0' + 52;
  }
  if (value == '+') {
    return 62;
  }
  if (value == '/') {
    return 63;
  }
  if (value == '=') {
    return -2;
  }
  return -1;
}

bool decodeBase64(const String &encoded, uint8_t **decodedBytes, size_t *decodedLength) {
  const size_t inputLength = encoded.length();
  if (inputLength == 0 || inputLength % 4 != 0) {
    return false;
  }

  size_t padding = 0;
  if (inputLength >= 1 && encoded.charAt(inputLength - 1) == '=') {
    ++padding;
  }
  if (inputLength >= 2 && encoded.charAt(inputLength - 2) == '=') {
    ++padding;
  }

  const size_t outputLength = (inputLength / 4) * 3 - padding;
  uint8_t *buffer = static_cast<uint8_t *>(malloc(outputLength > 0 ? outputLength : 1));
  if (buffer == nullptr) {
    return false;
  }

  size_t outputIndex = 0;
  for (size_t index = 0; index < inputLength; index += 4) {
    const int8_t value0 = decodeBase64Char(encoded.charAt(index));
    const int8_t value1 = decodeBase64Char(encoded.charAt(index + 1));
    const int8_t value2 = decodeBase64Char(encoded.charAt(index + 2));
    const int8_t value3 = decodeBase64Char(encoded.charAt(index + 3));
    if (value0 < 0 || value1 < 0 || value2 == -1 || value3 == -1) {
      free(buffer);
      return false;
    }

    const uint32_t sextet0 = static_cast<uint32_t>(value0);
    const uint32_t sextet1 = static_cast<uint32_t>(value1);
    const uint32_t sextet2 = value2 >= 0 ? static_cast<uint32_t>(value2) : 0;
    const uint32_t sextet3 = value3 >= 0 ? static_cast<uint32_t>(value3) : 0;
    const uint32_t triple =
        (sextet0 << 18U) | (sextet1 << 12U) | (sextet2 << 6U) | sextet3;

    if (outputIndex < outputLength) {
      buffer[outputIndex++] = static_cast<uint8_t>((triple >> 16U) & 0xFFU);
    }
    if (outputIndex < outputLength && value2 != -2) {
      buffer[outputIndex++] = static_cast<uint8_t>((triple >> 8U) & 0xFFU);
    }
    if (outputIndex < outputLength && value3 != -2) {
      buffer[outputIndex++] = static_cast<uint8_t>(triple & 0xFFU);
    }
  }

  *decodedBytes = buffer;
  *decodedLength = outputLength;
  return true;
}

uint16_t readLe16(const uint8_t *data) {
  return static_cast<uint16_t>(data[0]) |
         static_cast<uint16_t>(static_cast<uint16_t>(data[1]) << 8U);
}

uint32_t readLe32(const uint8_t *data) {
  return static_cast<uint32_t>(data[0]) |
         (static_cast<uint32_t>(data[1]) << 8U) |
         (static_cast<uint32_t>(data[2]) << 16U) |
         (static_cast<uint32_t>(data[3]) << 24U);
}

bool writeClientBuffer(Client &client, const uint8_t *data, size_t length) {
  while (length > 0) {
    const size_t written = client.write(data, length);
    if (written == 0) {
      return false;
    }
    data += written;
    length -= written;
    yield();
  }
  return true;
}

bool writeClientString(Client &client, const String &value) {
  return writeClientBuffer(client,
                           reinterpret_cast<const uint8_t *>(value.c_str()),
                           value.length());
}

bool writeBase64ToClient(Client &client, const uint8_t *data, const size_t length) {
  static const char table[] =
      "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

  char chunk[4];
  for (size_t index = 0; index < length; index += 3) {
    const uint32_t octetA = data[index];
    const uint32_t octetB = (index + 1 < length) ? data[index + 1] : 0;
    const uint32_t octetC = (index + 2 < length) ? data[index + 2] : 0;
    const uint32_t triple = (octetA << 16U) | (octetB << 8U) | octetC;

    chunk[0] = table[(triple >> 18U) & 0x3FU];
    chunk[1] = table[(triple >> 12U) & 0x3FU];
    chunk[2] = (index + 1 < length) ? table[(triple >> 6U) & 0x3FU] : '=';
    chunk[3] = (index + 2 < length) ? table[triple & 0x3FU] : '=';

    if (!writeClientBuffer(client, reinterpret_cast<const uint8_t *>(chunk), sizeof(chunk))) {
      return false;
    }
  }
  return true;
}

bool parseWavePcm(const uint8_t *audioBytes,
                  const size_t audioByteCount,
                  ParsedWavePcm *parsedWave,
                  String *errorDetail) {
  if (audioByteCount < 44) {
    *errorDetail = "decoded audio is too small to be a WAV file";
    return false;
  }
  if (memcmp(audioBytes, "RIFF", 4) != 0 || memcmp(audioBytes + 8, "WAVE", 4) != 0) {
    *errorDetail = "decoded audio is not RIFF/WAVE";
    return false;
  }

  bool sawFormatChunk = false;
  bool sawDataChunk = false;
  size_t offset = 12;
  while (offset + 8 <= audioByteCount) {
    const uint8_t *chunk = audioBytes + offset;
    const uint32_t chunkSize = readLe32(chunk + 4);
    size_t resolvedChunkSize = static_cast<size_t>(chunkSize);
    const size_t chunkDataOffset = offset + 8;
    const bool isDataChunk = memcmp(chunk, "data", 4) == 0;
    if (chunkDataOffset > audioByteCount) {
      *errorDetail = "wav chunk exceeds decoded payload length";
      return false;
    }
    if (resolvedChunkSize == 0xFFFFFFFFU && isDataChunk) {
      resolvedChunkSize = audioByteCount - chunkDataOffset;
    } else if (chunkDataOffset + resolvedChunkSize > audioByteCount) {
      if (isDataChunk) {
        // Some streamed/provider-generated WAVs leave the data chunk size as unknown.
        resolvedChunkSize = audioByteCount - chunkDataOffset;
      } else {
        *errorDetail = "wav chunk exceeds decoded payload length";
        return false;
      }
    }

    if (memcmp(chunk, "fmt ", 4) == 0) {
      if (resolvedChunkSize < 16) {
        *errorDetail = "wav fmt chunk is too small";
        return false;
      }
      const uint8_t *fmt = audioBytes + chunkDataOffset;
      parsedWave->audioFormat = readLe16(fmt);
      parsedWave->channelCount = readLe16(fmt + 2);
      parsedWave->sampleRateHz = readLe32(fmt + 4);
      parsedWave->bitsPerSample = readLe16(fmt + 14);
      sawFormatChunk = true;
    } else if (isDataChunk) {
      parsedWave->pcmData = audioBytes + chunkDataOffset;
      parsedWave->pcmByteCount = resolvedChunkSize;
      sawDataChunk = true;
    }

    offset = chunkDataOffset + resolvedChunkSize;
    if ((resolvedChunkSize & 0x1U) != 0U) {
      ++offset;
    }
  }

  if (!sawFormatChunk) {
    *errorDetail = "wav fmt chunk is missing";
    return false;
  }
  if (!sawDataChunk || parsedWave->pcmData == nullptr || parsedWave->pcmByteCount == 0) {
    *errorDetail = "wav data chunk is missing";
    return false;
  }
  if (parsedWave->audioFormat != 1) {
    *errorDetail = "wav audio format is not PCM";
    return false;
  }
  if (parsedWave->sampleRateHz == 0) {
    *errorDetail = "wav sample rate is invalid";
    return false;
  }
  return true;
}

void loadConfig() {
  g_config.ssid = trimCopy(g_preferences.getString(kPrefsKeySsid, ""));
  g_config.password = g_preferences.getString(kPrefsKeyPassword, "");
  g_config.cloudBaseUrl =
      trimCopy(g_preferences.getString(kPrefsKeyCloudBaseUrl, kDefaultCloudBaseUrl));
  g_config.sessionId = trimCopy(g_preferences.getString(kPrefsKeySessionId, ""));
  g_config.deviceId = trimCopy(g_preferences.getString(kPrefsKeyDeviceId, ""));
  g_config.locale = trimCopy(g_preferences.getString(kPrefsKeyLocale, kDefaultLocale));

  if (g_config.deviceId.isEmpty()) {
    g_config.deviceId = defaultDeviceId();
  }
  if (g_config.locale.isEmpty()) {
    g_config.locale = kDefaultLocale;
  }
}

void saveConfig(const RuntimeConfig &config) {
  g_preferences.putString(kPrefsKeySsid, config.ssid);
  g_preferences.putString(kPrefsKeyPassword, config.password);
  g_preferences.putString(kPrefsKeyCloudBaseUrl, config.cloudBaseUrl);
  g_preferences.putString(kPrefsKeySessionId, config.sessionId);
  g_preferences.putString(kPrefsKeyDeviceId, config.deviceId);
  g_preferences.putString(kPrefsKeyLocale, config.locale);
  loadConfig();
}

void clearStoredConfig() {
  g_preferences.remove(kPrefsKeySsid);
  g_preferences.remove(kPrefsKeyPassword);
  g_preferences.remove(kPrefsKeyCloudBaseUrl);
  g_preferences.remove(kPrefsKeySessionId);
  g_preferences.remove(kPrefsKeyDeviceId);
  g_preferences.remove(kPrefsKeyLocale);
  loadConfig();
}

