vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
String buildPairingPage() {
  String html;
  html.reserve(2600);
  html += F("<!DOCTYPE html><html><head><meta charset='utf-8'>");
  html += F("<meta name='viewport' content='width=device-width,initial-scale=1'>");
  html += F("<title>AI Pet Bring-up</title>");
  html += F("<style>body{font-family:Arial,sans-serif;max-width:720px;margin:24px auto;padding:0 16px;}");
  html += F("label{display:block;font-weight:600;margin-top:12px;}input{width:100%;padding:10px;margin-top:6px;box-sizing:border-box;}");
  html += F("button{margin-top:16px;padding:10px 16px;}code{background:#f4f4f4;padding:2px 4px;}small{color:#555;}");
  html += F("</style></head><body>");
  html += F("<h1>XIAO ESP32S3 Sense Bring-up</h1>");
  html += "<p>State: <strong>" + String(deviceStateToString(g_state)) + "</strong></p>";
  html += "<p>Last error: <strong>" + String(errorCodeToString(g_lastError)) + "</strong></p>";
  html += "<p>Pairing AP: <code>" + escapeHtml(g_pairingApSsid) + "</code></p>";
  html += F("<form method='POST' action='/save'>");
  html += "<label>Wi-Fi SSID<input name='ssid' value='" + escapeHtml(g_config.ssid) + "' required></label>";
  html += "<label>Wi-Fi Password<input name='password' type='password' value='" +
          escapeHtml(g_config.password) + "'></label>";
  html += "<label>Cloud Base URL<input name='cloudBaseUrl' value='" +
          escapeHtml(g_config.cloudBaseUrl) + "' required></label>";
  html += "<label>Session ID<input name='sessionId' value='" + escapeHtml(g_config.sessionId) +
          "' required></label>";
  html += "<label>Device ID<input name='deviceId' value='" + escapeHtml(g_config.deviceId) +
          "' required></label>";
  html += "<label>Locale<input name='locale' value='" + escapeHtml(g_config.locale) + "'></label>";
  html += F("<button type='submit'>Save And Reconnect</button></form>");
  html += F("<form method='POST' action='/clear'><button type='submit'>Clear Stored Config</button></form>");
  html += F("<p><small>Playback is enabled for MAX98357 on GPIO7/GPIO8/GPIO9. Trigger a full turn from serial with <code>listen</code>.</small></p>");
  html += F("</body></html>");
  return html;
}

void handleRootPage() { g_server.send(200, "text/html", buildPairingPage()); }

void handleStatusPage() {
  StaticJsonDocument<512> doc;
  doc["state"] = deviceStateToString(g_state);
  doc["lastError"] = errorCodeToString(g_lastError);
  doc["wifiConnected"] = g_wifiConnected;
  doc["cloudReachable"] = g_cloudReachable;
  doc["ip"] = WiFi.localIP().toString();
  doc["sessionId"] = g_config.sessionId;
  doc["deviceId"] = g_config.deviceId;
  doc["locale"] = g_config.locale;
  String payload;
  serializeJson(doc, payload);
  g_server.send(200, "application/json", payload);
}

void startPairingPortal(const String &reason) {
  if (g_pairingPortalActive) {
    transitionTo(DeviceState::PairingReady, reason);
    return;
  }

  WiFi.mode(WIFI_AP_STA);
  g_pairingApSsid = "AI-PET-SETUP-" + chipSuffix();
  WiFi.softAP(g_pairingApSsid.c_str(), kPairingApPassword);
  g_server.begin();
  g_pairingPortalActive = true;
  transitionTo(DeviceState::PairingReady, reason);
  logLine("pairing portal ready at http://192.168.4.1/");
}

void stopPairingPortal() {
  if (!g_pairingPortalActive) {
    return;
  }

  g_server.stop();
  WiFi.softAPdisconnect(true);
  g_pairingPortalActive = false;
  WiFi.mode(WIFI_STA);
}

void handleSaveConfig() {
  RuntimeConfig nextConfig;
  nextConfig.ssid = trimCopy(g_server.arg("ssid"));
  nextConfig.password = g_server.arg("password");
  nextConfig.cloudBaseUrl = trimCopy(g_server.arg("cloudBaseUrl"));
  nextConfig.sessionId = trimCopy(g_server.arg("sessionId"));
  nextConfig.deviceId = trimCopy(g_server.arg("deviceId"));
  nextConfig.locale = trimCopy(g_server.arg("locale"));

  if (nextConfig.deviceId.isEmpty()) {
    nextConfig.deviceId = defaultDeviceId();
  }
  if (nextConfig.locale.isEmpty()) {
    nextConfig.locale = kDefaultLocale;
  }

  saveConfig(nextConfig);
  g_reconnectRequested = true;
  clearError();
  g_server.send(
      200,
      "text/html",
      "<html><body><h1>Saved</h1><p>Config stored. Watch the serial log for reconnect status.</p></body></html>");
}

void handleClearConfig() {
  clearStoredConfig();
  g_wifiConnected = false;
  g_cloudReachable = false;
  clearError();
  WiFi.disconnect(true, true);
  startPairingPortal("config cleared, waiting for pairing");
  g_server.send(200, "text/html",
                "<html><body><h1>Cleared</h1><p>Stored config removed.</p></body></html>");
}

void configureWebRoutes() {
  g_server.on("/", HTTP_GET, handleRootPage);
  g_server.on("/status", HTTP_GET, handleStatusPage);
  g_server.on("/save", HTTP_POST, handleSaveConfig);
  g_server.on("/clear", HTTP_POST, handleClearConfig);
}

bool parseBaseUrl(const String &rawUrl, ParsedUrl *parsedUrl) {
  const String url = trimCopy(rawUrl);
  const int schemeSeparator = url.indexOf("://");
  if (schemeSeparator <= 0) {
    return false;
  }

  const String scheme = url.substring(0, schemeSeparator);
  const bool secure = scheme.equalsIgnoreCase("https");
  if (!secure && !scheme.equalsIgnoreCase("http")) {
    return false;
  }

  const String remainder = url.substring(schemeSeparator + 3);
  const int slashIndex = remainder.indexOf('/');
  const String hostPort = slashIndex >= 0 ? remainder.substring(0, slashIndex) : remainder;
  const String basePath = slashIndex >= 0 ? remainder.substring(slashIndex) : "";
  if (hostPort.isEmpty()) {
    return false;
  }

  String host = hostPort;
  uint16_t port = secure ? 443 : 80;
  const int colonIndex = hostPort.lastIndexOf(':');
  if (colonIndex > 0) {
    host = hostPort.substring(0, colonIndex);
    const String portText = hostPort.substring(colonIndex + 1);
    if (portText.isEmpty()) {
      return false;
    }
    port = static_cast<uint16_t>(portText.toInt());
    if (port == 0) {
      return false;
    }
  }

  parsedUrl->valid = true;
  parsedUrl->secure = secure;
  parsedUrl->host = host;
  parsedUrl->port = port;
  parsedUrl->basePath = basePath;
  return true;
}

String normalizedCloudBaseUrl() {
  String url = trimCopy(g_config.cloudBaseUrl);
  while (url.endsWith("/")) {
    url.remove(url.length() - 1);
  }
  return url;
}

