vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
String buildVoiceLoopUrl() {
  return normalizedCloudBaseUrl() + "/v1/internal/device-sessions/" + g_config.sessionId +
         "/voice-loop";
}

String buildVoiceLoopPath(const ParsedUrl &parsedUrl) {
  String path = parsedUrl.basePath;
  if (path.isEmpty()) {
    path = "";
  }
  while (path.endsWith("/")) {
    path.remove(path.length() - 1);
  }
  path += "/v1/internal/device-sessions/";
  path += g_config.sessionId;
  path += "/voice-loop";
  return path;
}

String buildAudioDownloadPath(const ParsedUrl &parsedUrl) {
  String path = parsedUrl.basePath;
  if (path.isEmpty()) {
    return "/";
  }
  if (!path.startsWith("/")) {
    path = "/" + path;
  }
  return path;
}

bool readHttpResponse(Client &client, int *statusCode, String *body) {
  const uint32_t startedAt = millis();
  while (!client.available() && client.connected() && millis() - startedAt < kHttpTimeoutMs) {
    delay(10);
  }

  if (!client.available()) {
    return false;
  }

  const String statusLine = client.readStringUntil('\n');
  const int firstSpace = statusLine.indexOf(' ');
  if (firstSpace < 0) {
    return false;
  }
  const int secondSpace = statusLine.indexOf(' ', firstSpace + 1);
  const String codeText =
      secondSpace > firstSpace ? statusLine.substring(firstSpace + 1, secondSpace)
                               : statusLine.substring(firstSpace + 1);
  *statusCode = codeText.toInt();
  if (*statusCode <= 0) {
    return false;
  }

  bool isChunked = false;
  int contentLength = -1;
  while (client.connected()) {
    String headerLine = client.readStringUntil('\n');
    headerLine.trim();
    if (headerLine.length() == 0) {
      break;
    }

    const int colonIndex = headerLine.indexOf(':');
    if (colonIndex < 0) {
      continue;
    }

    String headerName = headerLine.substring(0, colonIndex);
    String headerValue = headerLine.substring(colonIndex + 1);
    headerName.trim();
    headerValue.trim();
    headerName.toLowerCase();
    headerValue.toLowerCase();

    if (headerName == "transfer-encoding" && headerValue.indexOf("chunked") >= 0) {
      isChunked = true;
    } else if (headerName == "content-length") {
      contentLength = headerValue.toInt();
    }
  }

  if (isChunked) {
    body->reserve(1024);
    while (true) {
      String chunkSizeLine = client.readStringUntil('\n');
      chunkSizeLine.trim();
      const int semicolonIndex = chunkSizeLine.indexOf(';');
      if (semicolonIndex >= 0) {
        chunkSizeLine = chunkSizeLine.substring(0, semicolonIndex);
      }
      const size_t chunkSize = strtoul(chunkSizeLine.c_str(), nullptr, 16);
      if (chunkSize == 0) {
        while (client.connected()) {
          String trailerLine = client.readStringUntil('\n');
          trailerLine.trim();
          if (trailerLine.length() == 0) {
            break;
          }
        }
        return true;
      }

      size_t remaining = chunkSize;
      const uint32_t chunkStartedAt = millis();
      while (remaining > 0) {
        if (!client.available()) {
          if (!client.connected() || millis() - chunkStartedAt >= kHttpTimeoutMs) {
            return false;
          }
          delay(1);
          continue;
        }

        body->concat(static_cast<char>(client.read()));
        --remaining;
      }

      if (client.available() || client.connected()) {
        client.readStringUntil('\n');
      }
    }
  }

  if (contentLength >= 0) {
    body->reserve(contentLength);
    size_t remaining = static_cast<size_t>(contentLength);
    const uint32_t bodyStartedAt = millis();
    while (remaining > 0) {
      if (!client.available()) {
        if (!client.connected() || millis() - bodyStartedAt >= kHttpTimeoutMs) {
          return false;
        }
        delay(1);
        continue;
      }
      body->concat(static_cast<char>(client.read()));
      --remaining;
    }
    return true;
  }

  body->reserve(1024);
  const uint32_t bodyStartedAt = millis();
  while (client.connected() || client.available()) {
    while (client.available()) {
      body->concat(static_cast<char>(client.read()));
    }
    if (!client.connected()) {
      break;
    }
    if (millis() - bodyStartedAt >= kHttpTimeoutMs) {
      break;
    }
    delay(10);
  }

  return true;
}

bool readClientExact(Client &client, uint8_t *buffer, const size_t length) {
  size_t offset = 0;
  uint32_t lastReadAt = millis();
  while (offset < length) {
    if (!client.available()) {
      if (!client.connected() || millis() - lastReadAt >= kHttpTimeoutMs) {
        return false;
      }
      delay(1);
      continue;
    }

    const int value = client.read();
    if (value < 0) {
      continue;
    }

    buffer[offset++] = static_cast<uint8_t>(value);
    lastReadAt = millis();
  }
  return true;
}

bool skipClientBytes(Client &client, const size_t length) {
  size_t skipped = 0;
  uint32_t lastReadAt = millis();
  while (skipped < length) {
    if (!client.available()) {
      if (!client.connected() || millis() - lastReadAt >= kHttpTimeoutMs) {
        return false;
      }
      delay(1);
      continue;
    }

    const int value = client.read();
    if (value < 0) {
      continue;
    }

    ++skipped;
    lastReadAt = millis();
  }
  return true;
}

bool readHttpResponseHeaders(Client &client, HttpResponseMetadata *metadata) {
  metadata->statusCode = 0;
  metadata->chunked = false;
  metadata->contentLength = -1;
  metadata->contentType = "";

  const uint32_t startedAt = millis();
  while (!client.available() && client.connected() && millis() - startedAt < kHttpTimeoutMs) {
    delay(10);
  }

  if (!client.available()) {
    return false;
  }

  const String statusLine = client.readStringUntil('\n');
  const int firstSpace = statusLine.indexOf(' ');
  if (firstSpace < 0) {
    return false;
  }
  const int secondSpace = statusLine.indexOf(' ', firstSpace + 1);
  const String codeText =
      secondSpace > firstSpace ? statusLine.substring(firstSpace + 1, secondSpace)
                               : statusLine.substring(firstSpace + 1);
  metadata->statusCode = codeText.toInt();
  if (metadata->statusCode <= 0) {
    return false;
  }

