vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
  while (client.connected()) {
    String headerLine = client.readStringUntil('\n');
    headerLine.trim();
    if (headerLine.length() == 0) {
      break;
    }

    const int colonIndex = headerLine.indexOf(':');
    if (colonIndex < 0) {
      continue;
    }

    String headerName = headerLine.substring(0, colonIndex);
    String headerValue = headerLine.substring(colonIndex + 1);
    headerName.trim();
    headerValue.trim();

    String normalizedHeaderName = headerName;
    normalizedHeaderName.toLowerCase();
    String normalizedHeaderValue = headerValue;
    normalizedHeaderValue.toLowerCase();

    if (normalizedHeaderName == "transfer-encoding" &&
        normalizedHeaderValue.indexOf("chunked") >= 0) {
      metadata->chunked = true;
    } else if (normalizedHeaderName == "content-length") {
      metadata->contentLength = headerValue.toInt();
    } else if (normalizedHeaderName == "content-type") {
      metadata->contentType = headerValue;
    }
  }

  return true;
}

bool readHttpBinaryResponse(Client &client,
                            int *statusCode,
                            uint8_t **bodyBytes,
                            size_t *bodyLength,
                            String *contentType) {
  *bodyBytes = nullptr;
  *bodyLength = 0;
  *contentType = "";

  HttpResponseMetadata metadata;
  if (!readHttpResponseHeaders(client, &metadata)) {
    return false;
  }
  *statusCode = metadata.statusCode;
  *contentType = metadata.contentType;

  if (metadata.chunked || metadata.contentLength < 0) {
    return false;
  }

  uint8_t *buffer =
      static_cast<uint8_t *>(malloc(static_cast<size_t>(metadata.contentLength)));
  if (buffer == nullptr) {
    return false;
  }

  size_t offset = 0;
  const uint32_t bodyStartedAt = millis();
  while (offset < static_cast<size_t>(metadata.contentLength)) {
    if (!client.available()) {
      if (!client.connected() || millis() - bodyStartedAt >= kHttpTimeoutMs) {
        free(buffer);
        return false;
      }
      delay(1);
      continue;
    }

    const int value = client.read();
    if (value < 0) {
      continue;
    }
    buffer[offset++] = static_cast<uint8_t>(value);
  }

  *bodyBytes = buffer;
  *bodyLength = static_cast<size_t>(metadata.contentLength);
  return true;
}

bool executeHttpGetBinary(const ParsedUrl &parsedUrl,
                          const String &path,
                          int *statusCode,
                          uint8_t **bodyBytes,
                          size_t *bodyLength,
                          String *contentType) {
  if (parsedUrl.secure) {
    if (kCloudCaCertPem == nullptr && !kAllowInsecureHttps) {
      setError(ErrorCode::TlsConfigRequired,
               "HTTPS request blocked because no CA certificate is configured");
      return false;
    }

    WiFiClientSecure client;
    client.setTimeout(kHttpTimeoutMs);
    if (kCloudCaCertPem != nullptr) {
      client.setCACert(kCloudCaCertPem);
    } else {
      client.setInsecure();
    }
    if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
      setError(ErrorCode::CloudRequestFailed, "TLS connect failed before GET");
      return false;
    }

    client.printf("GET %s HTTP/1.1\r\n", path.c_str());
    client.printf("Host: %s:%u\r\n", parsedUrl.host.c_str(), parsedUrl.port);
    client.print("Connection: close\r\n\r\n");

    const bool ok = readHttpBinaryResponse(client, statusCode, bodyBytes, bodyLength, contentType);
    client.stop();
    if (!ok) {
      setError(ErrorCode::CloudRequestFailed, "failed to read HTTPS binary response");
      return false;
    }
    return true;
  }

  WiFiClient client;
  client.setTimeout(kHttpTimeoutMs);
  if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
    setError(ErrorCode::CloudRequestFailed, "TCP connect failed before GET");
    return false;
  }

  client.printf("GET %s HTTP/1.1\r\n", path.c_str());
  client.printf("Host: %s:%u\r\n", parsedUrl.host.c_str(), parsedUrl.port);
  client.print("Connection: close\r\n\r\n");

  const bool ok = readHttpBinaryResponse(client, statusCode, bodyBytes, bodyLength, contentType);
  client.stop();
  if (!ok) {
    setError(ErrorCode::CloudRequestFailed, "failed to read HTTP binary response");
    return false;
  }
  return true;
}

bool executeHttpJsonPost(const ParsedUrl &parsedUrl,
                         const String &path,
                         const String &payload,
                         int *statusCode,
                         String *body) {
  if (parsedUrl.secure) {
    if (kCloudCaCertPem == nullptr && !kAllowInsecureHttps) {
      setError(ErrorCode::TlsConfigRequired,
               "HTTPS request blocked because no CA certificate is configured");
      return false;
    }

    WiFiClientSecure client;
    client.setTimeout(kHttpTimeoutMs);
    if (kCloudCaCertPem != nullptr) {
      client.setCACert(kCloudCaCertPem);
    } else {
      client.setInsecure();
    }
    if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
      setError(ErrorCode::CloudRequestFailed, "TLS connect failed before POST");
      return false;
    }

    client.printf("POST %s HTTP/1.1\r\n", path.c_str());
    client.printf("Host: %s:%u\r\n", parsedUrl.host.c_str(), parsedUrl.port);
    client.print("Content-Type: application/json\r\n");
    client.print("Connection: close\r\n");
    client.printf("Content-Length: %u\r\n\r\n", payload.length());
    client.print(payload);

    const bool ok = readHttpResponse(client, statusCode, body);
    client.stop();
    if (!ok) {
      setError(ErrorCode::CloudRequestFailed, "failed to read HTTPS response");
      return false;
    }
    return true;
  }

  WiFiClient client;
  client.setTimeout(kHttpTimeoutMs);
  if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
    setError(ErrorCode::CloudRequestFailed, "TCP connect failed before POST");
    return false;
  }

  client.printf("POST %s HTTP/1.1\r\n", path.c_str());
  client.printf("Host: %s:%u\r\n", parsedUrl.host.c_str(), parsedUrl.port);
  client.print("Content-Type: application/json\r\n");
  client.print("Connection: close\r\n");
  client.printf("Content-Length: %u\r\n\r\n", payload.length());
  client.print(payload);

