vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
  const bool ok = readHttpResponse(client, statusCode, body);
  client.stop();
  if (!ok) {
    setError(ErrorCode::CloudRequestFailed, "failed to read HTTP response");
    return false;
  }
  return true;
}

bool executeHttpJsonPostWithBase64Audio(const ParsedUrl &parsedUrl,
                                        const String &path,
                                        const String &jsonPrefix,
                                        const uint8_t *audioBytes,
                                        const size_t audioByteCount,
                                        const String &jsonSuffix,
                                        int *statusCode,
                                        String *body) {
  const size_t contentLength =
      jsonPrefix.length() + base64EncodedLength(audioByteCount) + jsonSuffix.length();

  auto sendRequest = [&](Client &client) -> bool {
    client.printf("POST %s HTTP/1.1\r\n", path.c_str());
    client.printf("Host: %s:%u\r\n", parsedUrl.host.c_str(), parsedUrl.port);
    client.print("Content-Type: application/json\r\n");
    client.print("Connection: close\r\n");
    client.printf("Content-Length: %u\r\n\r\n", static_cast<unsigned int>(contentLength));

    if (!writeClientString(client, jsonPrefix)) {
      return false;
    }
    if (!writeBase64ToClient(client, audioBytes, audioByteCount)) {
      return false;
    }
    if (!writeClientString(client, jsonSuffix)) {
      return false;
    }
    return true;
  };

  if (parsedUrl.secure) {
    if (kCloudCaCertPem == nullptr && !kAllowInsecureHttps) {
      setError(ErrorCode::TlsConfigRequired,
               "HTTPS request blocked because no CA certificate is configured");
      return false;
    }

    WiFiClientSecure client;
    client.setTimeout(kHttpTimeoutMs);
    if (kCloudCaCertPem != nullptr) {
      client.setCACert(kCloudCaCertPem);
    } else {
      client.setInsecure();
    }
    if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
      setError(ErrorCode::CloudRequestFailed, "TLS connect failed before POST");
      return false;
    }

    if (!sendRequest(client)) {
      client.stop();
      setError(ErrorCode::CloudRequestFailed, "failed to stream HTTPS request body");
      return false;
    }

    const bool ok = readHttpResponse(client, statusCode, body);
    client.stop();
    if (!ok) {
      setError(ErrorCode::CloudRequestFailed, "failed to read HTTPS response");
      return false;
    }
    return true;
  }

  WiFiClient client;
  client.setTimeout(kHttpTimeoutMs);
  if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
    setError(ErrorCode::CloudRequestFailed, "TCP connect failed before POST");
    return false;
  }

  if (!sendRequest(client)) {
    client.stop();
    setError(ErrorCode::CloudRequestFailed, "failed to stream HTTP request body");
    return false;
  }

  const bool ok = readHttpResponse(client, statusCode, body);
  client.stop();
  if (!ok) {
    setError(ErrorCode::CloudRequestFailed, "failed to read HTTP response");
    return false;
  }
  return true;
}

bool probeCloudTransport() {
  ParsedUrl parsedUrl;
  if (!parseBaseUrl(g_config.cloudBaseUrl, &parsedUrl)) {
    setError(ErrorCode::ConfigMissing, "cloudBaseUrl is invalid");
    return false;
  }

  transitionTo(DeviceState::ConnectingCloud, "probing cloud transport");

  if (parsedUrl.secure) {
    if (kCloudCaCertPem == nullptr && !kAllowInsecureHttps) {
      setError(ErrorCode::TlsConfigRequired,
               "HTTPS endpoint configured without CA certificate or insecure override");
      return false;
    }

    WiFiClientSecure secureClient;
    secureClient.setTimeout(kCloudConnectTimeoutMs);
    if (kCloudCaCertPem != nullptr) {
      secureClient.setCACert(kCloudCaCertPem);
    } else {
      secureClient.setInsecure();
    }
    const bool connected = secureClient.connect(parsedUrl.host.c_str(), parsedUrl.port);
    secureClient.stop();
    if (!connected) {
      setError(ErrorCode::CloudProbeFailed, "TLS transport connect failed");
      return false;
    }
  } else {
    WiFiClient client;
    client.setTimeout(kCloudConnectTimeoutMs);
    const bool connected = client.connect(parsedUrl.host.c_str(), parsedUrl.port);
    client.stop();
    if (!connected) {
      setError(ErrorCode::CloudProbeFailed, "TCP transport connect failed");
      return false;
    }
  }

  g_cloudReachable = true;
  clearError();
  transitionTo(DeviceState::ReadyToSpeak, "cloud transport reachable");
  return true;
}

bool connectWiFi() {
  if (!g_config.hasWiFiCredentials()) {
    startPairingPortal("missing Wi-Fi credentials");
    return false;
  }

  clearError();
  transitionTo(DeviceState::ConnectingWiFi, "joining " + g_config.ssid);

  stopPairingPortal();
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(false);
  WiFi.disconnect(true, true);
  delay(100);
  WiFi.begin(g_config.ssid.c_str(), g_config.password.c_str());

  const uint32_t startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    g_wifiConnected = false;
    g_cloudReachable = false;
    setError(ErrorCode::WiFiConnectFailed, "timed out while joining configured network");
    startPairingPortal("Wi-Fi connect failed, waiting for updated config");
    return false;
  }

  g_wifiConnected = true;
  clearError();
  transitionTo(DeviceState::WiFiConnected, "ip=" + WiFi.localIP().toString());
  return true;
}

bool ensureConnectivityReady() {
  if (!g_config.hasWiFiCredentials() || !g_config.hasCloudConfig()) {
    startPairingPortal("missing Wi-Fi or cloud config");
    return false;
  }
  if (!g_wifiConnected && !connectWiFi()) {
    return false;
  }
  if (!g_cloudReachable && !probeCloudTransport()) {
    return false;
  }
  if (g_state != DeviceState::ReadyToSpeak) {
    transitionTo(DeviceState::ReadyToSpeak, "connectivity ready");
  }
  return true;
}

