vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
bool initializeMicrophone() {
  if (g_micInitialized) {
    return true;
  }

#if AI_PET_USE_ESP_I2S
  g_i2s.setPinsPdmRx(kPdmClockPin, kPdmDataPin);
  const bool began = g_i2s.begin(I2S_MODE_PDM_RX,
                                 kAudioSampleRateHz,
                                 I2S_DATA_BIT_WIDTH_16BIT,
                                 I2S_SLOT_MODE_MONO);
#else
  I2S.setAllPins(-1, kPdmClockPin, kPdmDataPin, -1, -1);
  const bool began = I2S.begin(PDM_MONO_MODE, kAudioSampleRateHz, 16);
#endif

  if (!began) {
    setError(ErrorCode::MicInitFailed, "Arduino I2S begin failed");
    return false;
  }

  g_micInitialized = true;
  logLine("microphone ready on GPIO41/GPIO42");
  return true;
}

bool initializePlayback() {
  if (!kEnablePlayback) {
    return true;
  }
  if (g_playbackInitialized) {
    return true;
  }

#if AI_PET_USE_ESP_I2S
  const i2s_data_bit_width_t playbackBitsConfig =
      kPlaybackBitsPerSample == 16 ? I2S_DATA_BIT_WIDTH_16BIT : I2S_DATA_BIT_WIDTH_16BIT;
  const i2s_slot_mode_t playbackSlotMode =
      kPlaybackChannels == 1 ? I2S_SLOT_MODE_MONO : I2S_SLOT_MODE_STEREO;
  g_playbackI2s.setPins(kPlaybackBclkPin, kPlaybackLrclkPin, kPlaybackDinPin);
  const bool began = g_playbackI2s.begin(I2S_MODE_STD,
                                         kPlaybackDefaultSampleRateHz,
                                         playbackBitsConfig,
                                         playbackSlotMode);
#else
  const bool began = false;
#endif

  if (!began) {
#if AI_PET_USE_ESP_I2S
    setError(ErrorCode::PlaybackInitFailed, "MAX98357 I2S TX init failed");
#else
    setError(ErrorCode::PlaybackInitFailed,
             "MAX98357 playback requires ESP32 Arduino core >= 3 with ESP_I2S");
#endif
    g_lastPlaybackResult = "failed";
    return false;
  }

  g_playbackInitialized = true;
  logLine("playback ready on MAX98357 BCLK=" + String(kPlaybackBclkPin) +
          " LRC=" + String(kPlaybackLrclkPin) + " DIN=" + String(kPlaybackDinPin));
  return true;
}

bool configurePlaybackFormat(const uint32_t sampleRateHz) {
#if AI_PET_USE_ESP_I2S
  return g_playbackI2s.configureTX(sampleRateHz,
                                   I2S_DATA_BIT_WIDTH_16BIT,
                                   I2S_SLOT_MODE_STEREO);
#else
  (void)sampleRateHz;
  return false;
#endif
}

bool writePlaybackChunk(const uint8_t *data, const size_t byteCount) {
#if AI_PET_USE_ESP_I2S
  const size_t written = g_playbackI2s.write(data, byteCount);
  if (written != byteCount) {
    setError(ErrorCode::PlaybackWriteFailed,
             "I2S write short write expected=" + String(byteCount) +
                 " actual=" + String(written) +
                 " err=" + String(g_playbackI2s.lastError()));
    g_lastPlaybackResult = "failed";
    return false;
  }
  return true;
#else
  (void)data;
  (void)byteCount;
  setError(ErrorCode::PlaybackWriteFailed, "I2S TX write is unavailable on this core");
  g_lastPlaybackResult = "failed";
  return false;
#endif
}

bool preparePlaybackForWave(const ParsedWavePcm &parsedWave) {
  if (!initializePlayback()) {
    return false;
  }
  if (parsedWave.bitsPerSample != 16) {
    setError(ErrorCode::PlaybackUnsupported,
             "only PCM16 WAV is supported, got bitsPerSample=" +
                 String(parsedWave.bitsPerSample));
    g_lastPlaybackResult = "unsupported";
    return false;
  }
  if (parsedWave.channelCount != 1 && parsedWave.channelCount != 2) {
    setError(ErrorCode::PlaybackUnsupported,
             "only mono/stereo WAV is supported, got channels=" +
                 String(parsedWave.channelCount));
    g_lastPlaybackResult = "unsupported";
    return false;
  }
  if ((parsedWave.pcmByteCount % (parsedWave.channelCount * sizeof(int16_t))) != 0) {
    setError(ErrorCode::PlaybackDecodeFailed, "wav pcm byte count is not frame-aligned");
    g_lastPlaybackResult = "failed";
    return false;
  }
  if (!configurePlaybackFormat(parsedWave.sampleRateHz)) {
    setError(ErrorCode::PlaybackInitFailed,
             "failed to configure I2S TX for sampleRateHz=" +
                 String(parsedWave.sampleRateHz));
    g_lastPlaybackResult = "failed";
    return false;
  }

  g_lastPlaybackSampleRateHz = parsedWave.sampleRateHz;
  g_lastPlaybackChannels = 2;
  g_lastPlaybackPcmBytes = parsedWave.channelCount == 2
                               ? parsedWave.pcmByteCount
                               : (parsedWave.pcmByteCount * 2);
  return true;
}

bool playParsedWave(const ParsedWavePcm &parsedWave) {
  if (!preparePlaybackForWave(parsedWave)) {
    return false;
  }

  const uint32_t startedAt = millis();
  if (parsedWave.channelCount == 2) {
    size_t written = 0;
    while (written < parsedWave.pcmByteCount) {
      const size_t chunkBytes =
          min(kPlaybackWriteChunkBytes, parsedWave.pcmByteCount - written);
      if (!writePlaybackChunk(parsedWave.pcmData + written, chunkBytes)) {
        return false;
      }
      written += chunkBytes;
      yield();
    }
  } else {
    constexpr size_t kMonoFramesPerChunk = 256;
    int16_t stereoChunk[kMonoFramesPerChunk * 2];
    const int16_t *monoPcm = reinterpret_cast<const int16_t *>(parsedWave.pcmData);
    size_t framesRemaining = parsedWave.pcmByteCount / sizeof(int16_t);
    size_t frameOffset = 0;
    while (framesRemaining > 0) {
      const size_t frameCount = min(kMonoFramesPerChunk, framesRemaining);
      for (size_t index = 0; index < frameCount; ++index) {
        const int16_t sample = monoPcm[frameOffset + index];
        stereoChunk[index * 2] = sample;
        stereoChunk[index * 2 + 1] = sample;
      }
      if (!writePlaybackChunk(reinterpret_cast<const uint8_t *>(stereoChunk),
                              frameCount * sizeof(int16_t) * 2)) {
        return false;
      }
      frameOffset += frameCount;
      framesRemaining -= frameCount;
      yield();
    }
  }

  g_lastPlaybackResult = "succeeded";
  logLine("playback done durationMs=" + String(millis() - startedAt) +
          " sampleRateHz=" + String(parsedWave.sampleRateHz) +
          " inputChannels=" + String(parsedWave.channelCount) +
          " outputChannels=2 pcmBytes=" + String(g_lastPlaybackPcmBytes));
  return true;
}

bool streamWavePcmFromClient(Client &client,
                             const int contentLength,
                             ParsedWavePcm *parsedWave,
                             String *errorDetail) {
  if (contentLength >= 0 && contentLength < 44) {
    *errorDetail = "streamed audio is too small to be a WAV file";
    return false;
  }

  uint8_t riffHeader[12];
  if (!readClientExact(client, riffHeader, sizeof(riffHeader))) {
    setError(ErrorCode::CloudRequestFailed, "timed out while reading WAV header");
    g_lastPlaybackResult = "failed";
    return false;
  }
  if (memcmp(riffHeader, "RIFF", 4) != 0 || memcmp(riffHeader + 8, "WAVE", 4) != 0) {
    *errorDetail = "streamed audio is not RIFF/WAVE";
    return false;
  }

  bool sawFormatChunk = false;
  size_t bodyBytesRead = sizeof(riffHeader);
  while (contentLength < 0 || bodyBytesRead + 8 <= static_cast<size_t>(contentLength)) {
    uint8_t chunkHeader[8];
    if (!readClientExact(client, chunkHeader, sizeof(chunkHeader))) {
      setError(ErrorCode::CloudRequestFailed, "timed out while reading WAV chunk header");
      g_lastPlaybackResult = "failed";
      return false;
    }
    bodyBytesRead += sizeof(chunkHeader);

    const uint32_t chunkSize = readLe32(chunkHeader + 4);
    size_t resolvedChunkSize = static_cast<size_t>(chunkSize);
    const bool isDataChunk = memcmp(chunkHeader, "data", 4) == 0;
    if (chunkSize == 0xFFFFFFFFU && isDataChunk) {
      if (contentLength < 0 || bodyBytesRead > static_cast<size_t>(contentLength)) {
        *errorDetail = "streamed wav data chunk length is invalid";
        return false;
      }
      resolvedChunkSize = static_cast<size_t>(contentLength) - bodyBytesRead;
    } else if (contentLength >= 0) {
      const size_t remaining = bodyBytesRead <= static_cast<size_t>(contentLength)
                                   ? static_cast<size_t>(contentLength) - bodyBytesRead
                                   : 0;
      if (resolvedChunkSize > remaining) {
        if (isDataChunk) {
          resolvedChunkSize = remaining;
        } else {
          *errorDetail = "streamed wav chunk exceeds payload length";
          return false;
        }
      }
    }

    if (memcmp(chunkHeader, "fmt ", 4) == 0) {
      if (resolvedChunkSize < 16) {
        *errorDetail = "wav fmt chunk is too small";
        return false;
      }

      uint8_t fmtChunk[16];
      if (!readClientExact(client, fmtChunk, sizeof(fmtChunk))) {
        setError(ErrorCode::CloudRequestFailed, "timed out while reading WAV fmt chunk");
        g_lastPlaybackResult = "failed";
        return false;
      }
      bodyBytesRead += sizeof(fmtChunk);

