vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
      parsedWave->audioFormat = readLe16(fmtChunk);
      parsedWave->channelCount = readLe16(fmtChunk + 2);
      parsedWave->sampleRateHz = readLe32(fmtChunk + 4);
      parsedWave->bitsPerSample = readLe16(fmtChunk + 14);
      sawFormatChunk = true;

      const size_t remainingFmtBytes = resolvedChunkSize - sizeof(fmtChunk);
      if (remainingFmtBytes > 0) {
        if (!skipClientBytes(client, remainingFmtBytes)) {
          setError(ErrorCode::CloudRequestFailed, "timed out while skipping WAV fmt extension");
          g_lastPlaybackResult = "failed";
          return false;
        }
        bodyBytesRead += remainingFmtBytes;
      }
    } else if (isDataChunk) {
      parsedWave->pcmByteCount = resolvedChunkSize;
      if (!sawFormatChunk) {
        *errorDetail = "wav fmt chunk must appear before data";
        return false;
      }
      logLine("wav parsed sampleRateHz=" + String(parsedWave->sampleRateHz) +
              " bitsPerSample=" + String(parsedWave->bitsPerSample) +
              " channels=" + String(parsedWave->channelCount) +
              " pcmBytes=" + String(parsedWave->pcmByteCount));
      if (!preparePlaybackForWave(*parsedWave)) {
        return false;
      }

      const uint32_t startedAt = millis();
      if (parsedWave->channelCount == 2) {
        uint8_t playbackChunk[kPlaybackWriteChunkBytes];
        size_t remainingPcmBytes = resolvedChunkSize;
        while (remainingPcmBytes > 0) {
          size_t chunkBytes = min(sizeof(playbackChunk), remainingPcmBytes);
          const size_t frameBytes = parsedWave->channelCount * sizeof(int16_t);
          if ((chunkBytes % frameBytes) != 0 && chunkBytes != remainingPcmBytes) {
            chunkBytes -= chunkBytes % frameBytes;
          }
          if (!readClientExact(client, playbackChunk, chunkBytes)) {
            setError(ErrorCode::CloudRequestFailed, "timed out while streaming WAV PCM data");
            g_lastPlaybackResult = "failed";
            return false;
          }
          if (!writePlaybackChunk(playbackChunk, chunkBytes)) {
            return false;
          }
          remainingPcmBytes -= chunkBytes;
          bodyBytesRead += chunkBytes;
          yield();
        }
      } else {
        constexpr size_t kMonoFramesPerChunk = 256;
        int16_t monoChunk[kMonoFramesPerChunk];
        int16_t stereoChunk[kMonoFramesPerChunk * 2];
        size_t remainingPcmBytes = resolvedChunkSize;
        while (remainingPcmBytes > 0) {
          size_t chunkBytes = min(sizeof(monoChunk), remainingPcmBytes);
          if ((chunkBytes % sizeof(int16_t)) != 0 && chunkBytes != remainingPcmBytes) {
            chunkBytes -= chunkBytes % sizeof(int16_t);
          }
          if (!readClientExact(client,
                               reinterpret_cast<uint8_t *>(monoChunk),
                               chunkBytes)) {
            setError(ErrorCode::CloudRequestFailed, "timed out while streaming WAV PCM data");
            g_lastPlaybackResult = "failed";
            return false;
          }

          const size_t frameCount = chunkBytes / sizeof(int16_t);
          for (size_t index = 0; index < frameCount; ++index) {
            const int16_t sample = monoChunk[index];
            stereoChunk[index * 2] = sample;
            stereoChunk[index * 2 + 1] = sample;
          }
          if (!writePlaybackChunk(reinterpret_cast<const uint8_t *>(stereoChunk),
                                  frameCount * sizeof(int16_t) * 2)) {
            return false;
          }
          remainingPcmBytes -= chunkBytes;
          bodyBytesRead += chunkBytes;
          yield();
        }
      }

      g_lastPlaybackResult = "succeeded";
      logLine("playback done durationMs=" + String(millis() - startedAt) +
              " sampleRateHz=" + String(parsedWave->sampleRateHz) +
              " inputChannels=" + String(parsedWave->channelCount) +
              " outputChannels=2 pcmBytes=" + String(g_lastPlaybackPcmBytes));
      return true;
    } else {
      if (!skipClientBytes(client, resolvedChunkSize)) {
        setError(ErrorCode::CloudRequestFailed, "timed out while skipping WAV chunk");
        g_lastPlaybackResult = "failed";
        return false;
      }
      bodyBytesRead += resolvedChunkSize;
    }

    if ((resolvedChunkSize & 0x1U) != 0U) {
      uint8_t padding = 0;
      if (!readClientExact(client, &padding, 1)) {
        setError(ErrorCode::CloudRequestFailed, "timed out while reading WAV chunk padding");
        g_lastPlaybackResult = "failed";
        return false;
      }
      ++bodyBytesRead;
    }
  }

  *errorDetail = "wav data chunk is missing";
  return false;
}

bool streamCloudAudioResponse(Client &client,
                              const String &audioUrl,
                              const String &fallbackAudioFormat) {
  HttpResponseMetadata metadata;
  if (!readHttpResponseHeaders(client, &metadata)) {
    setError(ErrorCode::CloudRequestFailed, "failed to read HTTP binary response");
    return false;
  }
  if (metadata.statusCode >= 400) {
    setError(ErrorCode::CloudRequestFailed,
             "audio download failed with status=" + String(metadata.statusCode));
    return false;
  }
  if (metadata.chunked) {
    setError(ErrorCode::CloudRequestFailed, "chunked audio download is not supported yet");
    return false;
  }

  const String resolvedAudioFormat =
      metadata.contentType.isEmpty() ? fallbackAudioFormat : metadata.contentType;
  g_lastPlaybackAudioFormat = resolvedAudioFormat.isEmpty() ? "unknown" : resolvedAudioFormat;
  if (!resolvedAudioFormat.isEmpty() && !resolvedAudioFormat.equalsIgnoreCase("audio/wav")) {
    setError(ErrorCode::PlaybackUnsupported,
             "cloud audioFormat is not supported for playback: " + resolvedAudioFormat);
    g_lastPlaybackResult = "unsupported";
    return false;
  }

  logLine("streaming cloud audio url=" + audioUrl +
          " bytes=" + String(metadata.contentLength) +
          " contentType=" + (metadata.contentType.isEmpty() ? String("<empty>") : metadata.contentType));

