vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
  ParsedWavePcm parsedWave;
  String errorDetail;
  if (!streamWavePcmFromClient(client, metadata.contentLength, &parsedWave, &errorDetail)) {
    if (!errorDetail.isEmpty() && g_lastError == ErrorCode::None) {
      setError(ErrorCode::PlaybackDecodeFailed, errorDetail);
      g_lastPlaybackResult = "failed";
    }
    return false;
  }
  return true;
}

bool streamCloudAudioFromUrl(const CloudResponseSummary &summary) {
  if (summary.audioUrl.isEmpty()) {
    return false;
  }

  ParsedUrl parsedUrl;
  String path;
  if (summary.audioUrl.startsWith("http://") || summary.audioUrl.startsWith("https://")) {
    if (!parseBaseUrl(summary.audioUrl, &parsedUrl)) {
      setError(ErrorCode::CloudRequestFailed, "audioUrl is invalid");
      return false;
    }
    path = buildAudioDownloadPath(parsedUrl);
  } else {
    if (!parseBaseUrl(g_config.cloudBaseUrl, &parsedUrl)) {
      setError(ErrorCode::ConfigMissing, "cloudBaseUrl is invalid");
      return false;
    }
    path = summary.audioUrl.startsWith("/") ? summary.audioUrl : "/" + summary.audioUrl;
  }

  if (parsedUrl.secure) {
    if (kCloudCaCertPem == nullptr && !kAllowInsecureHttps) {
      setError(ErrorCode::TlsConfigRequired,
               "HTTPS request blocked because no CA certificate is configured");
      return false;
    }

    WiFiClientSecure client;
    client.setTimeout(kHttpTimeoutMs);
    if (kCloudCaCertPem != nullptr) {
      client.setCACert(kCloudCaCertPem);
    } else {
      client.setInsecure();
    }
    if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
      setError(ErrorCode::CloudRequestFailed, "TLS connect failed before GET");
      return false;
    }

    client.printf("GET %s HTTP/1.1\r\n", path.c_str());
    client.printf("Host: %s:%u\r\n", parsedUrl.host.c_str(), parsedUrl.port);
    client.print("Connection: close\r\n\r\n");

    const bool ok = streamCloudAudioResponse(client, summary.audioUrl, summary.audioFormat);
    client.stop();
    return ok;
  }

  WiFiClient client;
  client.setTimeout(kHttpTimeoutMs);
  if (!client.connect(parsedUrl.host.c_str(), parsedUrl.port)) {
    setError(ErrorCode::CloudRequestFailed, "TCP connect failed before GET");
    return false;
  }

  client.printf("GET %s HTTP/1.1\r\n", path.c_str());
  client.printf("Host: %s:%u\r\n", parsedUrl.host.c_str(), parsedUrl.port);
  client.print("Connection: close\r\n\r\n");

  const bool ok = streamCloudAudioResponse(client, summary.audioUrl, summary.audioFormat);
  client.stop();
  return ok;
}

bool downloadCloudAudioBytes(const CloudResponseSummary &summary,
                             uint8_t **audioBytes,
                             size_t *audioByteCount,
                             String *resolvedAudioFormat) {
  if (summary.audioUrl.isEmpty()) {
    return false;
  }

  ParsedUrl parsedUrl;
  String path;
  if (summary.audioUrl.startsWith("http://") || summary.audioUrl.startsWith("https://")) {
    if (!parseBaseUrl(summary.audioUrl, &parsedUrl)) {
      setError(ErrorCode::CloudRequestFailed, "audioUrl is invalid");
      return false;
    }
    path = buildAudioDownloadPath(parsedUrl);
  } else {
    if (!parseBaseUrl(g_config.cloudBaseUrl, &parsedUrl)) {
      setError(ErrorCode::ConfigMissing, "cloudBaseUrl is invalid");
      return false;
    }
    path = summary.audioUrl.startsWith("/") ? summary.audioUrl : "/" + summary.audioUrl;
  }

  int statusCode = 0;
  String contentType;
  if (!executeHttpGetBinary(parsedUrl, path, &statusCode, audioBytes, audioByteCount, &contentType)) {
    return false;
  }
  if (statusCode >= 400) {
    if (*audioBytes != nullptr) {
      free(*audioBytes);
      *audioBytes = nullptr;
      *audioByteCount = 0;
    }
    setError(ErrorCode::CloudRequestFailed,
             "audio download failed with status=" + String(statusCode));
    return false;
  }

  *resolvedAudioFormat = summary.audioFormat;
  if (resolvedAudioFormat->isEmpty()) {
    *resolvedAudioFormat = contentType;
  }

  logLine("downloaded cloud audio url=" + summary.audioUrl +
          " bytes=" + String(*audioByteCount) +
          " contentType=" + (contentType.isEmpty() ? String("<empty>") : contentType));
  return true;
}

bool playCloudAudio(const CloudResponseSummary &summary) {
  g_lastPlaybackAudioFormat = summary.audioFormat.isEmpty() ? "unknown" : summary.audioFormat;
  g_lastPlaybackResult = "decoding";
  g_lastPlaybackSampleRateHz = 0;
  g_lastPlaybackChannels = 0;
  g_lastPlaybackPcmBytes = 0;

  uint8_t *decodedAudio = nullptr;
  size_t decodedAudioLength = 0;
  String resolvedAudioFormat = summary.audioFormat;

  if (!summary.audioUrl.isEmpty()) {
    if (!streamCloudAudioFromUrl(summary)) {
      g_lastPlaybackResult = "failed";
      return false;
    }
    return true;
  } else if (!summary.audioBase64.isEmpty()) {
    if (!decodeBase64(summary.audioBase64, &decodedAudio, &decodedAudioLength)) {
      setError(ErrorCode::PlaybackDecodeFailed, "audioBase64 could not be decoded");
      g_lastPlaybackResult = "failed";
      return false;
    }

    logLine("decoded cloud audio format=" + g_lastPlaybackAudioFormat +
            " base64Bytes=" + String(summary.audioBase64.length()) +
            " decodedBytes=" + String(decodedAudioLength));
  } else {
    setError(ErrorCode::CloudAudioMissing, "cloud response did not include audioBase64 or audioUrl");
    g_lastPlaybackResult = "missing";
    return false;
  }

  if (!resolvedAudioFormat.isEmpty() && !resolvedAudioFormat.equalsIgnoreCase("audio/wav")) {
    setError(ErrorCode::PlaybackUnsupported,
             "cloud audioFormat is not supported for playback: " + resolvedAudioFormat);
    g_lastPlaybackResult = "unsupported";
    if (decodedAudio != nullptr) {
      free(decodedAudio);
    }
    return false;
  }

  ParsedWavePcm parsedWave;
  String errorDetail;
  const bool parsed = parseWavePcm(decodedAudio, decodedAudioLength, &parsedWave, &errorDetail);
  if (!parsed) {
    free(decodedAudio);
    setError(ErrorCode::PlaybackDecodeFailed, errorDetail);
    g_lastPlaybackResult = "failed";
    return false;
  }

  logLine("wav parsed sampleRateHz=" + String(parsedWave.sampleRateHz) +
          " bitsPerSample=" + String(parsedWave.bitsPerSample) +
          " channels=" + String(parsedWave.channelCount) +
          " pcmBytes=" + String(parsedWave.pcmByteCount));

  const bool played = playParsedWave(parsedWave);
  free(decodedAudio);
  return played;
}

void releaseCapturedAudio(CapturedAudio *capturedAudio) {
  if (capturedAudio->samples != nullptr) {
    free(capturedAudio->samples);
    capturedAudio->samples = nullptr;
  }
  capturedAudio->byteCount = 0;
  capturedAudio->sampleCount = 0;
  capturedAudio->durationMs = 0;
  capturedAudio->strategy = CaptureStrategy::FixedWindow;
  capturedAudio->exitReason = CaptureExitReason::FixedWindow;
  capturedAudio->speechDetected = false;
}

bool readPdmSamples(int16_t *destination,
                    const size_t sampleCount,
                    uint32_t *lastBytesReadAt) {
  size_t index = 0;
  while (index < sampleCount) {
    int sample = -1;
#if AI_PET_USE_ESP_I2S
    sample = g_i2s.read();
#else
    sample = I2S.read();
#endif

    if (sample < 0) {
      if (millis() - *lastBytesReadAt >= kAudioCaptureStallTimeoutMs) {
        setError(ErrorCode::MicCaptureFailed, "timed out waiting for PDM microphone data");
        return false;
      }
      delay(1);
      continue;
    }

    destination[index] = static_cast<int16_t>(sample);
    *lastBytesReadAt = millis();
    ++index;
    yield();
  }
  return true;
}

uint32_t computeFrameEnergy(const int16_t *samples, const size_t sampleCount) {
  if (sampleCount == 0) {
    return 0;
  }

  int64_t sum = 0;
  for (size_t index = 0; index < sampleCount; ++index) {
    sum += samples[index];
  }
  const int32_t mean = static_cast<int32_t>(sum / static_cast<int64_t>(sampleCount));

  uint64_t deviationSum = 0;
  for (size_t index = 0; index < sampleCount; ++index) {
    const int32_t centered = static_cast<int32_t>(samples[index]) - mean;
    deviationSum += centered >= 0 ? centered : -centered;
  }

