vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
  return static_cast<uint32_t>(deviationSum / sampleCount);
}

uint32_t updateNoiseFloor(const uint32_t currentFloor, const uint32_t frameEnergy) {
  if (currentFloor == 0) {
    return max(frameEnergy, static_cast<uint32_t>(1));
  }
  return max(static_cast<uint32_t>((currentFloor * 7 + frameEnergy) / 8),
             static_cast<uint32_t>(1));
}

void logVadStateTransition(const VadState state, const String &detail = String()) {
  if (detail.isEmpty()) {
    logLine("vad state -> " + String(vadStateToString(state)));
    return;
  }
  logLine("vad state -> " + String(vadStateToString(state)) + " | " + detail);
}

bool captureAudioFixedWindow(CapturedAudio *capturedAudio) {
  const size_t targetByteCount =
      (kAudioSampleRateHz * kAudioCaptureMs / 1000) * sizeof(int16_t);
  const size_t targetSampleCount = targetByteCount / sizeof(int16_t);

  logLine("capture strategy=" + String(captureStrategyToString(CaptureStrategy::FixedWindow)) +
          " durationMs=" + String(kAudioCaptureMs) +
          " expectedBytes=" + String(targetByteCount) +
          " expectedSamples=" + String(targetSampleCount));

  capturedAudio->samples = static_cast<int16_t *>(malloc(targetByteCount));
  if (capturedAudio->samples == nullptr) {
    setError(ErrorCode::MicCaptureFailed, "malloc failed for fixed capture buffer");
    return false;
  }

  memset(capturedAudio->samples, 0, targetByteCount);

  const uint32_t startedAt = millis();
  uint32_t lastBytesReadAt = startedAt;
  if (!readPdmSamples(capturedAudio->samples, targetSampleCount, &lastBytesReadAt)) {
    releaseCapturedAudio(capturedAudio);
    return false;
  }

  capturedAudio->sampleCount = targetSampleCount;
  capturedAudio->byteCount = targetByteCount;
  capturedAudio->durationMs = millis() - startedAt;
  capturedAudio->strategy = CaptureStrategy::FixedWindow;
  capturedAudio->exitReason = CaptureExitReason::FixedWindow;
  capturedAudio->speechDetected = true;
  logLine("captured durationMs=" + String(capturedAudio->durationMs) +
          " bytes=" + String(capturedAudio->byteCount) +
          " samples=" + String(capturedAudio->sampleCount));
  return true;
}

bool captureAudioLightweightVad(CapturedAudio *capturedAudio) {
  const size_t maxByteCount = kVadMaxSampleCount * sizeof(int16_t);
  capturedAudio->samples = static_cast<int16_t *>(malloc(maxByteCount));
  if (capturedAudio->samples == nullptr) {
    setError(ErrorCode::MicCaptureFailed, "malloc failed for vad capture buffer");
    return false;
  }

  memset(capturedAudio->samples, 0, maxByteCount);

  logLine("capture strategy=" +
          String(captureStrategyToString(CaptureStrategy::LightweightVad)) +
          " frameMs=" + String(kVadFrameMs) + " minMs=" + String(kVadMinCaptureMs) +
          " maxMs=" + String(kVadMaxCaptureMs) +
          " fallbackFixedMs=" + String(kAudioCaptureMs));

  VadState vadState = VadState::Priming;
  logVadStateTransition(vadState, "measuring ambient noise floor");
  CaptureExitReason exitReason = CaptureExitReason::MaxCapture;

  uint32_t lastBytesReadAt = millis();
  size_t totalSamplesRead = 0;
  size_t speechStartSampleIndex = 0;
  size_t bootstrapFramesCollected = 0;
  uint32_t bootstrapEnergySum = 0;
  uint32_t noiseFloor = 0;
  uint32_t trailingSilenceMs = 0;
  uint32_t consecutiveSpeechFrames = 0;
  uint32_t consecutiveResumeFrames = 0;
  uint32_t tailWindowStartedAtMs = 0;
  uint32_t confirmWindowStartedAtMs = 0;
  bool speechDetected = false;

  while (totalSamplesRead + kVadFrameSampleCount <= kVadMaxSampleCount) {
    int16_t *frameStart = capturedAudio->samples + totalSamplesRead;
    if (!readPdmSamples(frameStart, kVadFrameSampleCount, &lastBytesReadAt)) {
      releaseCapturedAudio(capturedAudio);
      return false;
    }

    totalSamplesRead += kVadFrameSampleCount;
    const uint32_t totalCaptureMs = (totalSamplesRead * 1000) / kAudioSampleRateHz;
    const uint32_t frameEnergy = computeFrameEnergy(frameStart, kVadFrameSampleCount);

    if (vadState == VadState::Priming) {
      bootstrapEnergySum += frameEnergy;
      ++bootstrapFramesCollected;
      if (bootstrapFramesCollected >= kVadBootstrapFrameCount) {
        noiseFloor =
            max(static_cast<uint32_t>(bootstrapEnergySum / bootstrapFramesCollected),
                static_cast<uint32_t>(1));
        vadState = VadState::WaitingForSpeech;
        logVadStateTransition(vadState, "noiseFloor=" + String(noiseFloor));
      }
      continue;
    }

    const uint32_t startThreshold =
        max(kVadStartFloorAbs,
            static_cast<uint32_t>((noiseFloor * kVadStartRatioNum) / kVadStartRatioDen) +
                kVadStartOffsetAbs);
    const uint32_t endThreshold =
        max(kVadEndFloorAbs,
            static_cast<uint32_t>((noiseFloor * kVadEndRatioNum) / kVadEndRatioDen) +
                kVadEndOffsetAbs);
    const uint32_t resumeThreshold = endThreshold + kVadResumeOffsetAbs;

    if (!speechDetected) {
      if (frameEnergy >= startThreshold) {
        ++consecutiveSpeechFrames;
      } else {
        consecutiveSpeechFrames = 0;
        noiseFloor = updateNoiseFloor(noiseFloor, frameEnergy);
      }

      if (consecutiveSpeechFrames >= kVadStartTriggerFrames) {
        speechDetected = true;
        const size_t triggerLookbackSamples =
            kVadPreRollSampleCount + (kVadStartTriggerFrames * kVadFrameSampleCount);
        speechStartSampleIndex =
            totalSamplesRead > triggerLookbackSamples ? totalSamplesRead - triggerLookbackSamples
                                                      : 0;
        vadState = VadState::Speaking;
        logVadStateTransition(
            vadState,
            "frameEnergy=" + String(frameEnergy) + " noiseFloor=" + String(noiseFloor) +
                " startThreshold=" + String(startThreshold) +
                " speechStartMs=" +
                String((speechStartSampleIndex * 1000) / kAudioSampleRateHz));
      } else if (totalCaptureMs >= kAudioCaptureMs) {
        vadState = VadState::FallbackFixedWindow;
        exitReason = CaptureExitReason::FallbackNoSpeech;
        logVadStateTransition(vadState,
                              "no speech detected before fallback baseline window");
        break;
      }
      continue;
    }

    const uint32_t speechDurationMs =
        ((totalSamplesRead - speechStartSampleIndex) * 1000) / kAudioSampleRateHz;

