vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
    if (frameEnergy <= endThreshold) {
      consecutiveResumeFrames = 0;
      trailingSilenceMs += kVadFrameMs;
      if (vadState != VadState::TrailingSilence) {
        if (vadState == VadState::Speaking) {
          tailWindowStartedAtMs = totalCaptureMs;
          confirmWindowStartedAtMs = 0;
          vadState = VadState::TrailingSilence;
          logVadStateTransition(vadState,
                                "frameEnergy=" + String(frameEnergy) +
                                    " endThreshold=" + String(endThreshold));
        }
      }
      if (vadState == VadState::TrailingSilence &&
          speechDurationMs >= kVadMinCaptureMs &&
          trailingSilenceMs >= kVadEndSilenceMs) {
        vadState = VadState::ConfirmingEnd;
        confirmWindowStartedAtMs = totalCaptureMs;
        logVadStateTransition(vadState,
                              "trailingSilenceMs=" + String(trailingSilenceMs) +
                                  " confirmMs=" + String(kVadEndConfirmMs));
      }
      if (vadState == VadState::ConfirmingEnd &&
          confirmWindowStartedAtMs > 0 &&
          totalCaptureMs >= confirmWindowStartedAtMs + kVadEndConfirmMs) {
        vadState = VadState::Complete;
        exitReason = CaptureExitReason::EndOfSpeech;
        logVadStateTransition(vadState,
                              "reason=end_of_speech_confirmed speechDurationMs=" +
                                  String(speechDurationMs) +
                                  " trailingSilenceMs=" + String(trailingSilenceMs) +
                                  " confirmMs=" + String(kVadEndConfirmMs));
        break;
      }
    } else if ((vadState == VadState::TrailingSilence || vadState == VadState::ConfirmingEnd) &&
               frameEnergy < resumeThreshold) {
      consecutiveResumeFrames = 0;
    } else {
      ++consecutiveResumeFrames;
      if (vadState != VadState::TrailingSilence && vadState != VadState::ConfirmingEnd) {
        trailingSilenceMs = 0;
        consecutiveResumeFrames = 0;
      } else if (consecutiveResumeFrames >= kVadResumeTriggerFrames) {
        trailingSilenceMs = 0;
        consecutiveResumeFrames = 0;
        confirmWindowStartedAtMs = 0;
        tailWindowStartedAtMs = 0;
        vadState = VadState::Speaking;
        logVadStateTransition(vadState,
                              "speech resumed frameEnergy=" + String(frameEnergy) +
                                  " resumeThreshold=" + String(resumeThreshold) +
                                  " trailingSilenceMs=" + String(trailingSilenceMs));
      }
    }

    if (speechDurationMs >= kVadMinCaptureMs && trailingSilenceMs >= kVadEndSilenceMs) {
      if (vadState == VadState::ConfirmingEnd &&
          confirmWindowStartedAtMs > 0 &&
          totalCaptureMs >= confirmWindowStartedAtMs + kVadEndConfirmMs) {
        vadState = VadState::Complete;
        exitReason = CaptureExitReason::EndOfSpeech;
        logVadStateTransition(vadState,
                              "reason=end_of_speech_confirmed speechDurationMs=" +
                                  String(speechDurationMs) +
                                  " trailingSilenceMs=" + String(trailingSilenceMs) +
                                  " confirmMs=" + String(kVadEndConfirmMs));
        break;
      }
    }

    if (vadState == VadState::ConfirmingEnd &&
        speechDurationMs >= kVadMinCaptureMs &&
        trailingSilenceMs >= kVadPostSpeechGuardMinSilenceMs &&
        tailWindowStartedAtMs > 0 &&
        totalCaptureMs >= tailWindowStartedAtMs + kVadPostSpeechMaxMs) {
      vadState = VadState::Complete;
      exitReason = CaptureExitReason::EndOfSpeech;
      logVadStateTransition(vadState,
                            "reason=end_of_speech_guard speechDurationMs=" +
                                String(speechDurationMs) +
                                " trailingSilenceMs=" + String(trailingSilenceMs) +
                                " guardMinSilenceMs=" +
                                String(kVadPostSpeechGuardMinSilenceMs) +
                                " tailWindowMs=" +
                                String(totalCaptureMs - tailWindowStartedAtMs));
      break;
    }

    if ((vadState == VadState::TrailingSilence || vadState == VadState::ConfirmingEnd) &&
        speechDurationMs >= kVadMinCaptureMs &&
        trailingSilenceMs >= kVadNearMaxEndSilenceMs &&
        totalCaptureMs + kVadNearMaxWindowMs >= kVadMaxCaptureMs) {
      vadState = VadState::Complete;
      exitReason = CaptureExitReason::EndOfSpeech;
      logVadStateTransition(vadState,
                            "reason=end_of_speech_near_max_capture speechDurationMs=" +
                                String(speechDurationMs) +
                                " trailingSilenceMs=" + String(trailingSilenceMs) +
                                " nearMaxWindowMs=" + String(kVadNearMaxWindowMs));
      break;
    }

    if (totalCaptureMs >= kVadMaxCaptureMs) {
      vadState = VadState::Complete;
      exitReason = CaptureExitReason::MaxCapture;
      logVadStateTransition(vadState,
                            "reason=max_capture totalCaptureMs=" + String(totalCaptureMs));
      break;
    }
  }

  size_t finalStartSampleIndex = 0;
  size_t finalSampleCount = totalSamplesRead;
  if (speechDetected) {
    finalStartSampleIndex = speechStartSampleIndex;
    finalSampleCount = totalSamplesRead - speechStartSampleIndex;
  }

  if (finalSampleCount == 0) {
    releaseCapturedAudio(capturedAudio);
    setError(ErrorCode::MicCaptureFailed, "captured zero samples");
    return false;
  }

  if (speechDetected && finalStartSampleIndex > 0) {
    memmove(capturedAudio->samples,
            capturedAudio->samples + finalStartSampleIndex,
            finalSampleCount * sizeof(int16_t));
  }

  capturedAudio->sampleCount = finalSampleCount;
  capturedAudio->byteCount = finalSampleCount * sizeof(int16_t);
  capturedAudio->durationMs = (finalSampleCount * 1000) / kAudioSampleRateHz;
  capturedAudio->strategy = CaptureStrategy::LightweightVad;
  capturedAudio->exitReason = exitReason;
  capturedAudio->speechDetected = speechDetected;
  logLine("captured durationMs=" + String(capturedAudio->durationMs) +
          " bytes=" + String(capturedAudio->byteCount) +
          " samples=" + String(capturedAudio->sampleCount) +
          " speechDetected=" + String(speechDetected ? "true" : "false"));
  return true;
}

bool captureAudio(CapturedAudio *capturedAudio) {
  if (!initializeMicrophone()) {
    return false;
  }

