vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
  if (kEnableLightweightVad) {
    return captureAudioLightweightVad(capturedAudio);
  }
  return captureAudioFixedWindow(capturedAudio);
}

bool parseCloudResponse(const String &body, CloudResponseSummary *summary) {
  const size_t docCapacity =
      max(static_cast<size_t>(8192), body.length() + static_cast<size_t>(1024));
  DynamicJsonDocument doc(docCapacity);
  const auto error = deserializeJson(doc, body);
  if (error) {
    String preview = body.substring(0, 160);
    preview.replace("\r", "\\r");
    preview.replace("\n", "\\n");
    logLine("cloud body preview: " + preview);
    setError(ErrorCode::JsonParseFailed, String("deserializeJson failed: ") + error.c_str());
    return false;
  }

  summary->sessionState = String(static_cast<const char *>(doc["session"]["state"] | "unknown"));
  summary->transcript = String(static_cast<const char *>(doc["transcript"] | ""));
  summary->responseText = String(static_cast<const char *>(doc["responseText"] | ""));
  summary->audioBase64 = String(static_cast<const char *>(doc["audioBase64"] | ""));
  summary->audioFormat = String(static_cast<const char *>(doc["audioFormat"] | ""));
  summary->audioUrl = String(static_cast<const char *>(doc["audioUrl"] | ""));
  summary->fallbackMode = String(static_cast<const char *>(doc["fallbackMode"] | "none"));
  summary->runtimeFailureCode =
      String(static_cast<const char *>(doc["runtimeFailureCode"] | "unknown"));
  return true;
}

bool postVoiceTurn(CapturedAudio *capturedAudio, CloudResponseSummary *summary) {
  const String requestId =
      g_config.deviceId + "-turn-" + String(++g_turnCounter) + "-" + String(millis());
  const uint32_t captureDurationMs = capturedAudio->durationMs;
  const CaptureStrategy captureStrategy = capturedAudio->strategy;
  const CaptureExitReason captureExitReason = capturedAudio->exitReason;
  const bool speechDetected = capturedAudio->speechDetected;
  const uint8_t *audioBytes = reinterpret_cast<const uint8_t *>(capturedAudio->samples);
  const size_t audioByteCount = capturedAudio->byteCount;

  logLine("heap before POST: " + String(ESP.getFreeHeap()));

  String jsonPrefix;
  jsonPrefix.reserve(160);
  jsonPrefix += "{\"requestId\":\"";
  jsonPrefix += escapeJson(requestId);
  jsonPrefix += "\",\"audioBase64\":\"";

  String jsonSuffix;
  jsonSuffix.reserve(128);
  jsonSuffix += "\",\"audioFormat\":\"audio/pcm;codec=s16le;rate=16000;channels=1\"";
  jsonSuffix += ",\"sampleRateHz\":";
  jsonSuffix += String(kAudioSampleRateHz);
  jsonSuffix += ",\"durationMs\":";
  jsonSuffix += String(captureDurationMs);
  jsonSuffix += ",\"locale\":\"";
  jsonSuffix += escapeJson(g_config.locale);
  jsonSuffix += "\"}";

  logLine("post audio bytes=" + String(audioByteCount) +
          " base64Bytes=" + String(base64EncodedLength(audioByteCount)) +
          " contentLength=" +
          String(jsonPrefix.length() + base64EncodedLength(audioByteCount) +
                 jsonSuffix.length()));

  ParsedUrl parsedUrl;
  if (!parseBaseUrl(g_config.cloudBaseUrl, &parsedUrl)) {
    releaseCapturedAudio(capturedAudio);
    setError(ErrorCode::ConfigMissing, "cloudBaseUrl is invalid");
    return false;
  }

  int statusCode = 0;
  String body;
  const String path = buildVoiceLoopPath(parsedUrl);
  if (!executeHttpJsonPostWithBase64Audio(parsedUrl,
                                          path,
                                          jsonPrefix,
                                          audioBytes,
                                          audioByteCount,
                                          jsonSuffix,
                                          &statusCode,
                                          &body)) {
    releaseCapturedAudio(capturedAudio);
    return false;
  }

  releaseCapturedAudio(capturedAudio);

  summary->httpStatus = statusCode;
  const bool parsed = parseCloudResponse(body, summary);
  if (!parsed) {
    return false;
  }

  g_lastSessionState = summary->sessionState;
  g_lastTranscript = summary->transcript;
  g_lastResponseText = summary->responseText;
  g_lastRuntimeFailureCode = summary->runtimeFailureCode;
  g_lastPlaybackAudioFormat = summary->audioFormat.isEmpty() ? "none" : summary->audioFormat;

  logLine("cloud http=" + String(summary->httpStatus) + " session=" + summary->sessionState +
          " fallback=" + summary->fallbackMode + " failure=" + summary->runtimeFailureCode +
          " audioFormat=" + (summary->audioFormat.isEmpty() ? String("<empty>")
                                                             : summary->audioFormat));
  if (!summary->transcript.isEmpty()) {
    logLine("transcript: " + summary->transcript);
  }
  if (!summary->responseText.isEmpty()) {
    logLine("responseText: " + summary->responseText);
  }
  logLine("turn summary | strategy=" + String(captureStrategyToString(captureStrategy)) +
          " durationMs=" + String(captureDurationMs) +
          " exit=" + String(captureExitReasonToString(captureExitReason)) +
          " speechDetected=" + String(speechDetected ? "true" : "false") +
          " transcript=" + (summary->transcript.isEmpty() ? String("<empty>")
                                                          : summary->transcript) +
          " fallback=" + summary->fallbackMode +
          " failure=" + summary->runtimeFailureCode);
  return true;
}

bool runVoiceTurn() {
  if (!ensureConnectivityReady()) {
    return false;
  }

  transitionTo(DeviceState::Listening, "capturing microphone input");
  CapturedAudio capturedAudio;
  if (!captureAudio(&capturedAudio)) {
    return false;
  }

  transitionTo(DeviceState::Thinking, "uploading audio to cloud");
  CloudResponseSummary summary;
  const bool posted = postVoiceTurn(&capturedAudio, &summary);
  if (!posted) {
    return false;
  }

  if (kEnablePlayback) {
    transitionTo(DeviceState::Speaking, "decoding and playing cloud audio");
    if (!playCloudAudio(summary)) {
      return false;
    }
  }

  clearError();
  g_cloudReachable = true;
  transitionTo(DeviceState::ReadyToSpeak,
               kEnablePlayback ? "turn completed with playback" : "turn completed");
  return true;
}

void printHelp() {
  Serial.println("Commands:");
  Serial.println("  help       - show commands");
  Serial.println("  status     - print state and config summary");
  Serial.println("  pairing    - start pairing portal");
  Serial.println("  listen     - capture one turn and upload it");
  Serial.println("  reconnect  - force Wi-Fi and cloud reconnect");
  Serial.println("  clear      - erase stored config and reopen pairing mode");
}

void handleSerialCommand(const String &rawCommand) {
  const String command = trimCopy(rawCommand);
  if (command.isEmpty()) {
    return;
  }

