vickeygum123-sudo/ai-pet/firmware/arduino/xiao_esp32s3_sense_bringup/xiao_esp32s3_sense_bringup.ino
  if (command.equalsIgnoreCase("help")) {
    printHelp();
    return;
  }
  if (command.equalsIgnoreCase("status")) {
    logStatusSummary();
    Serial.printf("[config] ssid=%s cloudBaseUrl=%s deviceId=%s locale=%s\n",
                  g_config.ssid.c_str(),
                  g_config.cloudBaseUrl.c_str(),
                  g_config.deviceId.c_str(),
                  g_config.locale.c_str());
    Serial.printf("[cloud] sessionState=%s runtimeFailure=%s\n", g_lastSessionState.c_str(),
                  g_lastRuntimeFailureCode.c_str());
    if (!g_lastErrorDetail.isEmpty()) {
      Serial.printf("[error-detail] %s\n", g_lastErrorDetail.c_str());
    }
    return;
  }
  if (command.equalsIgnoreCase("pairing")) {
    startPairingPortal("pairing requested over serial");
    return;
  }
  if (command.equalsIgnoreCase("listen")) {
    runVoiceTurn();
    return;
  }
  if (command.equalsIgnoreCase("reconnect")) {
    g_wifiConnected = false;
    g_cloudReachable = false;
    g_reconnectRequested = true;
    logLine("manual reconnect requested");
    return;
  }
  if (command.equalsIgnoreCase("clear")) {
    clearStoredConfig();
    g_wifiConnected = false;
    g_cloudReachable = false;
    WiFi.disconnect(true, true);
    startPairingPortal("config cleared over serial");
    return;
  }

  logLine("unknown command: " + command);
  printHelp();
}

void handleSerialCommands() {
  if (!Serial.available()) {
    return;
  }

  const String command = Serial.readStringUntil('\n');
  handleSerialCommand(command);
}

void maintainConnectivity() {
  const bool currentlyConnected = WiFi.status() == WL_CONNECTED;
  if (currentlyConnected != g_wifiConnected) {
    g_wifiConnected = currentlyConnected;
    if (!currentlyConnected) {
      g_cloudReachable = false;
      if (g_config.hasWiFiCredentials()) {
        transitionTo(DeviceState::ConnectingWiFi, "Wi-Fi link lost, waiting to reconnect");
      }
    }
  }

  if (!g_config.hasWiFiCredentials() || !g_config.hasCloudConfig()) {
    startPairingPortal("waiting for Wi-Fi and cloud config");
    return;
  }

  const bool reconnectDue =
      g_reconnectRequested || millis() - g_lastReconnectAttemptAtMs >= kWifiRetryIntervalMs;

  if ((!g_wifiConnected || !g_cloudReachable) && reconnectDue) {
    g_reconnectRequested = false;
    g_lastReconnectAttemptAtMs = millis();
    if (connectWiFi()) {
      probeCloudTransport();
    }
  }
}

} // namespace

void setup() {
  Serial.begin(kSerialBaud);
  delay(1000);
  Serial.println();
  Serial.println("AI Pet XIAO ESP32S3 Sense bring-up");
  Serial.printf("firmware=%s playback=%s\n", kFirmwareVersion,
                AI_PET_ENABLE_PLAYBACK ? "enabled" : "disabled");

  transitionTo(DeviceState::Booting, "initializing board");

  g_preferences.begin(kPrefsNamespace, false);
  loadConfig();
  configureWebRoutes();

  logLine("deviceId=" + g_config.deviceId);
  logLine("cloudBaseUrl=" + g_config.cloudBaseUrl);

  if (!initializeMicrophone()) {
    return;
  }
  if (kEnablePlayback && !initializePlayback()) {
    return;
  }

  if (!g_config.hasWiFiCredentials() || !g_config.hasCloudConfig()) {
    startPairingPortal("stored config missing");
    printHelp();
    return;
  }

  ensureConnectivityReady();
  printHelp();
}

void loop() {
  if (g_pairingPortalActive) {
    g_server.handleClient();
  }

  handleSerialCommands();
  maintainConnectivity();
  delay(10);
}
